function UserSetting($scope) {
    $scope.json = [
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿'
        },
        {
            title:'用户公告',
            create:'2017/3/23 19:22:22',
            content:'尊敬的用户：打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿打不打卡收到啦到哪里是大手大脚阿里斯顿'
        }
    ]
    var containerheight = $('.view_main').height();
    console.log(containerheight);
    var maxlistheight = containerheight - 160;
    $('.list').css('max-height',''+maxlistheight+'px');
}